Dishoungh/MSP432_Game_System/game.c
/*
 * game.c
 *
 *  Created on: Dec 7, 2017
 *      Author: alex
 */
#include "msp.h"
#include "game.h"
#include "msp_boosterpack_lcd/lcd.h"

const GAME game_array[3] = {DEBUG,PONG,DODGE};

void initialize_buttons(void){
    button_flag = 0;

    //upper button setup
    P5->SEL0 &= ~BIT1;
    P5->SEL0 &= ~BIT1;
    P5->DIR &= ~BIT1;
    P5->REN |= BIT1;
    P5->OUT |= BIT1;            //pullup resistor activated
    P5->IFG &= ~BIT1;
    P5->IES |= BIT1;            //falling edge trigger
    P5->IE |= BIT1;             //interrupts enabled
    NVIC_EnableIRQ(PORT5_IRQn);

    //lower button setup
    P3->SEL0 &= ~BIT3;
    P3->SEL0 &= ~BIT3;
    P3->DIR &= ~BIT3;
    P3->REN |= BIT3;
    P3->OUT |= BIT3;            //pullup resistor activated
    P3->IFG &= ~BIT3;
    P3->IES |= BIT3;            //falling edge trigger
    P3->IE |= BIT3;             //interrupts enabled
    NVIC_EnableIRQ(PORT3_IRQn);
}
/*draws start screen*/
void draw_start_screen(void){
    LCD_erase_screen();

    initialize_rectangle(&start_screen, START_SCREEN_X, START_SCREEN_Y, START_SCREEN_WIDTH, START_SCREEN_HEIGHT, BLACK);
    LCD_write_string("PRESS BUTTON", start_screen.x, start_screen.y + LCD_CHAR_HEIGHT, BLACK, 12);
    LCD_write_string("  TO START  ", start_screen.x, start_screen.y, BLACK, 12);
    while(!button_flag);
    start_screen.x -= LCD_CHAR_WIDTH;
    LCD_erase_rectangle(start_screen);
    start_screen.x += LCD_CHAR_WIDTH;
    button_flag = 0;
}

//allows the user to select what game they want to play
void select_game(void){
    LCD_erase_screen();

    current_game = 2;

    RECT game_menu;
    initialize_rectangle(&game_menu,GAME_MENU_X,GAME_MENU_Y,GAME_MENU_WIDTH,GAME_MENU_HEIGHT,BLACK);

    RECT game_select;
    initialize_rectangle(&game_select,GAME_SELECT_X,GAME_SELECT_Y,GAME_SELECT_WIDTH,GAME_SELECT_HEIGHT,RED);
    LCD_draw_rectangle(game_select);

    LCD_write_string("CHOOSE GAME",game_menu.x,game_menu.y + 3*LCD_CHAR_HEIGHT,RED,11);
    LCD_write_string(" DEBUG     ",game_menu.x,game_menu.y + 2*LCD_CHAR_HEIGHT,BLACK,11);
    LCD_write_string(" PONG      ",game_menu.x,game_menu.y + LCD_CHAR_HEIGHT,BLACK,11);
    LCD_write_string(" DODGE     ",game_menu.x,game_menu.y,BLACK,11);


    while(!button_flag){
        ADC14->CTL0 |= ADC14_CTL0_SC;       //start ADC conversion
        if(timer_trigger && !timer_delay){
            //if joystick is moved up and the selection is not already at the top, move selection
            if((bit_joy_y > JOY_HIGH_THRESHOLD) && (current_game > 0)){
                LCD_erase_rectangle(game_select);
                //change game selection
                current_game--;
                //change visual selection box
                game_select.y += LCD_CHAR_HEIGHT;
                LCD_draw_rectangle(game_select);
                timer_delay = 10;
            }
            //if joystick is moved down and the selection is not already at the bottom, move selection
            else if((bit_joy_y < JOY_LOW_THRESHOLD) && (current_game < 2)){
                LCD_erase_rectangle(game_select);
                //change game selection
                current_game++;
                //change visual selection box
                game_select.y -= LCD_CHAR_HEIGHT;
                LCD_draw_rectangle(game_select);
                timer_delay = 10;
            }
        }
    }
    LCD_erase_rectangle(game_select);
    game_menu.x -= LCD_CHAR_WIDTH;
    LCD_erase_rectangle(game_menu);
    button_flag = 0;

    timer_delay = 25;
}
/*runs given game*/
void run_game(GAME game){
    switch(game){
    case PONG:
        pong_mode = STANDARD_MODE;
        //have user select winning score for game
        pong_max_score();
        while(timer_delay);

        //have user select color of paddle
        pong_paddle_color();
        while(timer_delay);

        /*initialize and start the pong game*/
        initialize_pong();

        /*enter main pong game section*/
        pong_main();

        /*display winner and end pong*/
        end_pong();

        button_flag = 0;
        break;

    case DODGE:
        run_dodge();
        button_flag = 0;
        break;

    case DEBUG:
        full_debug();
        button_flag = 0;
        break;
    }
}
/*function that runs the debug app*/
void full_debug(void){
    uint8_t button_toggle = 0;
    CIRCLE test_circle;
    initialize_circle(&test_circle, 50, 25, 20, BLACK, RED);
    LCD_draw_circle(test_circle);
    /*
    LCD_draw_vline(70, 5, 45, RED);
    LCD_draw_vline(30, 5, 45, RED);
    LCD_draw_hline(5, RED);
    LCD_draw_hline(45, RED);*/

    while(1){
        ADC14->CTL0 |= ADC14_CTL0_SC;       //start ADC conversion
        if(timer_trigger && ~timer_delay){
            //Joy Vertical
            if(bit_joy_y > JOY_HIGH_THRESHOLD){
                //Vertical Up
                LCD_write_string("V UP", DEBUG_DIRECTION_X, DEBUG_VERTICAL_Y, BLACK, 4);
            }
            else if(bit_joy_y < JOY_LOW_THRESHOLD){
                //Vertical Down
                LCD_write_string("V DN", DEBUG_DIRECTION_X, DEBUG_VERTICAL_Y, BLACK, 4);
            }
            else{
                //Vertical Mid
                LCD_write_string("V MD", DEBUG_DIRECTION_X, DEBUG_VERTICAL_Y, BLACK, 4);
            }

            //Joy Horizontal
            if(bit_joy_x > JOY_HIGH_THRESHOLD){
                //Horizontal Right
                LCD_write_string("H RT", DEBUG_DIRECTION_X, DEBUG_HORIZONTAL_Y, BLACK, 4);
            }
            else if(bit_joy_x < JOY_LOW_THRESHOLD){
                //Horizontal Left
                LCD_write_string("H LT", DEBUG_DIRECTION_X, DEBUG_HORIZONTAL_Y, BLACK, 4);
            }
            else{
                //Horizontal Mid
                LCD_write_string("H MD", DEBUG_DIRECTION_X, DEBUG_HORIZONTAL_Y, BLACK, 4);
            }

            //write actual joystick bit values
            uint8_t i = 0;
            for(i=0; i < sizeof(bit_joy_y_string)/sizeof(uint8_t); i++){
                bit_joy_y_string[i] = ' ';
            }
            itoa(bit_joy_y,bit_joy_y_string);
            LCD_write_string(bit_joy_y_string,10,DEBUG_VERTICAL_Y,BLACK,4);
            for(i=0; i < sizeof(bit_joy_x_string)/sizeof(uint8_t); i++){
                bit_joy_x_string[i] = ' ';
            }
            itoa(bit_joy_x,bit_joy_x_string);
            LCD_write_string(bit_joy_x_string,10,DEBUG_HORIZONTAL_Y,BLACK,4);

            //Button
            LCD_write_string("BUTTON", DEBUG_BUTTON_X, DEBUG_BUTTON_Y, BLACK, 6);
            if(button_flag){
                //Yes Button
                button_toggle ^= 1;
                button_flag = 0;
            }
            LCD_write_character(char_lib_num[button_toggle],DEBUG_BUTTON_TOGGLE_X, DEBUG_BUTTON_Y, BLACK);
            timer_trigger = 0;
        }
        button_flag = 0;
    }
}

