Dishoungh/MSP432_Game_System/game.c
/*initializes the parameters for pong*/
void initialize_pong(void){
    yvelocity = 0;
    xvelocity = 1;

    score_1 = 0;
    score_2 = 0;

    at_left = 0;
    at_right = 0;

    ball_color = BLACK;

    if(pong_mode == DEBUG_MODE){
        field_bottom = 22;
        LCD_draw_hline(21,BLACK);
    }
    else{
        field_bottom = 11;
    }


    initialize_rectangle(&ball, PONG_INITIAL_BALL_X, PONG_INITIAL_BALL_Y, PONG_BALL_WIDTH, PONG_BALL_HEIGHT, ball_color);
    LCD_draw_rectangle(ball);

    initialize_rectangle(&right, PONG_RIGHT_PADDLE_X, PONG_INITIAL_PADDLE_Y, PONG_PADDLE_WIDTH, PONG_PADDLE_HEIGHT, color_array[right_paddle_color]);
    LCD_draw_rectangle(right);

    initialize_rectangle(&left, PONG_LEFT_PADDLE_X, PONG_INITIAL_PADDLE_Y, PONG_PADDLE_WIDTH, PONG_PADDLE_HEIGHT, color_array[left_paddle_color]);
    LCD_draw_rectangle(left);

    //draw a line to separate the field and scoreboard
    LCD_draw_hline(10,BLACK);

    LCD_write_character(char_lib_num[0],10,0,color_array[right_paddle_color]);
    LCD_write_character(char_lib_num[0],110,0,color_array[left_paddle_color]);

    uint8_t scoreboard_string[] = "FIRST TO ";
    LCD_write_string(scoreboard_string,70 - (7*sizeof(scoreboard_string)/2),0,BLACK,sizeof(scoreboard_string)/sizeof(uint8_t));
    LCD_write_character(char_lib_num[max_score],70 - (7*sizeof(scoreboard_string)/2) - 7,0,BLACK);

    button_flag = 0;
}

/*code to choose the maximum score*/
void pong_max_score(void){
    max_score = 5;
    LCD_write_string(" MAX SCORE? ",start_screen.x,start_screen.y + 10,BLACK,12);
    LCD_write_character(char_lib_num[max_score],60,start_screen.y,BLACK);

    while(!button_flag){
        ADC14->CTL0 |= ADC14_CTL0_SC;       //start ADC conversion
        if ((timer_trigger == 1) && !timer_delay){
            if(bit_joy_y > JOY_HIGH_THRESHOLD){
                max_score++;
                max_score = max_score % 10;                 //max score cannot be any larger than 10
                LCD_write_character(char_lib_num[max_score],60,start_screen.y,BLACK);
                timer_delay = 10;
            }
            if((bit_joy_y < JOY_LOW_THRESHOLD)){
                if(max_score == 0){
                    max_score = 9;
                }
                else{
                    max_score--;
                }
                LCD_write_character(char_lib_num[max_score],60,start_screen.y,BLACK);
                timer_delay = 10;
            }

            if(pong_mode == DEBUG_MODE){
                //write actual joystick bit values
                itoa(bit_joy_y,bit_joy_y_string);
                LCD_write_string(bit_joy_y_string,100,11,BLACK,4);

                itoa(bit_joy_x,bit_joy_x_string);
                LCD_write_string(bit_joy_x_string,10,11,BLACK,4);
            }
            timer_trigger = 0;
        }
    }
    start_screen.x -= 7;
    LCD_erase_rectangle(start_screen);
    start_screen.x += 7;
    button_flag = 0;
    timer_delay = 15;
}
/*choose the color of the paddle*/
void pong_paddle_color(void){
    left_paddle_color = 9;
    right_paddle_color = 8;

    LCD_write_string("SELECT COLOR",start_screen.x,start_screen.y + 10,BLACK,12);

    initialize_rectangle(&right, PONG_RIGHT_PADDLE_X, PONG_INITIAL_PADDLE_Y, PONG_PADDLE_WIDTH, PONG_PADDLE_HEIGHT, color_array[right_paddle_color]);
    LCD_draw_rectangle(right);

    initialize_rectangle(&left, PONG_LEFT_PADDLE_X, PONG_INITIAL_PADDLE_Y, PONG_PADDLE_WIDTH, PONG_PADDLE_HEIGHT, color_array[left_paddle_color]);
    LCD_draw_rectangle(left);

    while(!button_flag){
        ADC14->CTL0 |= ADC14_CTL0_SC;       //start ADC conversion
        if ((timer_trigger == 1) && !timer_delay){
            if(bit_joy_y > JOY_HIGH_THRESHOLD){
                left_paddle_color++;
                left_paddle_color = left_paddle_color % 14;
                left.color = color_array[left_paddle_color];
                LCD_draw_rectangle(left);
                timer_delay = 10;
            }
            else if(bit_joy_y < JOY_LOW_THRESHOLD){
                if(left_paddle_color == 0){
                    left_paddle_color = 13;
                }
                else{
                    left_paddle_color--;
                }
                left.color = color_array[left_paddle_color];
                LCD_draw_rectangle(left);
                timer_delay = 10;
            }
            if(bit_joy_x > JOY_HIGH_THRESHOLD){
                right_paddle_color++;
                right_paddle_color = right_paddle_color % 14;
                right.color = color_array[right_paddle_color];
                LCD_draw_rectangle(right);
                timer_delay = 10;
            }
            else if(bit_joy_x < JOY_LOW_THRESHOLD){
                if(right_paddle_color == 0){
                    right_paddle_color = 13;
                }
                else{
                    right_paddle_color--;
                }
                right.color = color_array[right_paddle_color];
                LCD_draw_rectangle(right);
                timer_delay = 10;
            }

            if(pong_mode == DEBUG_MODE){
                //write actual joystick bit values
                itoa(bit_joy_y,bit_joy_y_string);
                LCD_write_string(bit_joy_y_string,100,11,BLACK,4);

                itoa(bit_joy_x,bit_joy_x_string);
                LCD_write_string(bit_joy_x_string,10,11,BLACK,4);
            }
            timer_trigger = 0;
        }
    }
    start_screen.x -= 7;
    LCD_erase_rectangle(start_screen);
    start_screen.x += 7;
    button_flag = 0;
    timer_delay = 15;
}

/*run actual pong game*/
void pong_main(void){
    while((score_1 < max_score) && (score_2 < max_score)){
        ADC14->CTL0 |= ADC14_CTL0_SC;       //start ADC conversion
        if ((timer_trigger == 1) && !timer_delay){
            LCD_erase_rectangle(ball);

            if(pong_mode == DEBUG_MODE){
                //write actual joystick bit values
                itoa(bit_joy_y,bit_joy_y_string);
                LCD_write_string(bit_joy_y_string,100,11,BLACK,4);

                itoa(bit_joy_x,bit_joy_x_string);
                LCD_write_string(bit_joy_x_string,10,11,BLACK,4);
            }

            if((ball.y <= field_bottom) || (ball.y >= (LCD_MAX_Y - ball.height))){
                yvelocity *= -1;
            }
            /*is ball at left edge of field?*/
            if((ball.x >= left.x - ball.width - 1)){
                //if the paddle is there to block ball reverse the direction, if not count score for player 2
                if ((ball.y > (left.y - ball.height)) && (ball.y < (left.y + left.height))){
                    xvelocity *= -1;
                    at_left = 1;
                }
                else {
                    ball.x = 50;
                    ball.y = 50;
                    xvelocity = -1;
                    yvelocity = 0;
                    score_2++;
                    LCD_write_character(char_lib_num[score_2],10,0,color_array[right_paddle_color]);
                    timer_delay = 25;
                }
            }
            /*is ball at right edge of field?*/
            if ((ball.x <= right.width + 1)){
                //if baddle is there to block ball reverse the direction, if not count score for player 1
                if ((ball.y > (right.y - ball.height)) && (ball.y < (right.y + right.height))){
                    xvelocity *= -1;
                    at_right = 1;
                }
                else {
                    ball.x = 50;
                    ball.y = 50;
                    xvelocity = 1;
                    yvelocity = 0;
                    score_1++;
                    LCD_write_character(char_lib_num[score_1],110,0,color_array[left_paddle_color]);
                    timer_delay = 25;
                }
            }
            ball.y += yvelocity;
            ball.x += xvelocity;
            LCD_draw_rectangle(ball);

            //left paddle movement with joystick
            if((bit_joy_y > JOY_HIGH_THRESHOLD) && (left.y != (LCD_MAX_Y - left.height))){  //up && not top
                //move up
                LCD_erase_rectangle(left);
                left.y++;
                LCD_draw_rectangle(left);
                if(at_left){        //if ball is at paddle and paddle is moving, change velocity of ball
                    yvelocity++;
                }
            }
            if((bit_joy_y < JOY_LOW_THRESHOLD) && (left.y >= (field_bottom +1))){  //down && not bottom
                //move down
                LCD_erase_rectangle(left);
                left.y--;
                LCD_draw_rectangle(left);
                if(at_left){        //if ball is at paddle and paddle is moving, change velocity of ball
                    yvelocity--;
                }
            }

            //right - sloppily done with joystick x axis until we have second joystick
            if((bit_joy_x > JOY_HIGH_THRESHOLD) && (right.y != (LCD_MAX_X - right.height))){  //up (right) && not top
                //move up
                LCD_erase_rectangle(right);
                right.y++;
                LCD_draw_rectangle(right);
                if(at_right){        //if ball is at paddle and paddle is moving, change velocity of ball
                    yvelocity++;
                }
            }
            if((bit_joy_x < JOY_LOW_THRESHOLD) && (right.y >= (field_bottom + 1))){  //down (left) && not bottom
                //move down
                LCD_erase_rectangle(right);
                right.y--;
                LCD_draw_rectangle(right);
                if(at_left){        //if ball is at paddle and paddle is moving, change velocity of ball
                    yvelocity--;
                }
            }

            at_right = 0;
            at_left = 0;
            //draw a line to separate the field and scoreboard
            LCD_draw_hline(10,BLACK);



            timer_trigger = 0;
            button_flag = 0;
        }
    }
}
 /*ends the pong game*/
void end_pong(void){
    LCD_erase_screen();
    initialize_rectangle(&start_screen,23,40,LCD_CHAR_WIDTH*14,20,BLACK);
    if(score_1 > score_2){
        LCD_write_string("PLAYER 1 WINS!",start_screen.x,start_screen.y,BLACK,14);
    }
    else{
        LCD_write_string("PLAYER 2 WINS!",start_screen.x,start_screen.y,BLACK,14);
    }
    while(!button_flag);
    start_screen.x -= 7;
    LCD_erase_rectangle(start_screen);
    start_screen.x += 7;
    button_flag = 0;
}

//game to avoid the red enemies for as long as possible
void run_dodge(void)
{

    uint8_t obs_speed = 1;

    //initialize player state and obstacle states
    DODGE_STATE player_state = ALIVE;
    DODGE_STATE obs_1_state  = ALIVE;
    DODGE_STATE obs_2_state  = DEAD;
    DODGE_STATE obs_3_state  = DEAD;
    DODGE_STATE obs_4_state  = DEAD;
    DODGE_STATE bullet_state = DEAD;

    //initialize player and obstacle rectangles
    CIRCLE player;
    DIRECTION xdir;
    DIRECTION ydir;
    initialize_circle(&player,DODGE_PLAYER_START_X,DODGE_PLAYER_START_Y,DODGE_PLAYER_RADIUS,NAVY,NAVY);
    LCD_draw_circle(player);

