Dishoungh/MSP432_Game_System/game.c
    RECT obs_1;
    initialize_rectangle(&obs_1,DODGE_OBS_1_START_X,DODGE_OBS_1_START_Y,DODGE_BOX_WIDTH,DODGE_BOX_HEIGHT,RED);
    LCD_draw_rectangle(obs_1);
    int8_t obs_1_x_velocity = obs_speed;
    int8_t obs_1_y_velocity = obs_speed;
    uint8_t obs_1_pause     = 0;

    RECT obs_2;
    initialize_rectangle(&obs_2,DODGE_OBS_2_START_X,DODGE_OBS_2_START_Y,DODGE_BOX_WIDTH,DODGE_BOX_HEIGHT,RED);
    int8_t obs_2_x_velocity = -1 * obs_speed;
    int8_t obs_2_y_velocity = -1 * obs_speed;
    uint8_t obs_2_pause     = 0;

    RECT obs_3;
    initialize_rectangle(&obs_3,DODGE_OBS_3_START_X,DODGE_OBS_3_START_Y,DODGE_BOX_WIDTH,DODGE_BOX_HEIGHT,RED);
    int8_t obs_3_x_velocity = -1 * obs_speed;
    int8_t obs_3_y_velocity = obs_speed;
    uint8_t obs_3_pause     = 0;

    RECT obs_4;
    initialize_rectangle(&obs_4,DODGE_OBS_4_START_X,DODGE_OBS_4_START_Y,DODGE_BOX_WIDTH,DODGE_BOX_HEIGHT,RED);
    int8_t obs_4_x_velocity = -1 * obs_speed;
    int8_t obs_4_y_velocity = obs_speed;
    uint8_t obs_4_pause     = 0;

    // Initialize Bullet
    CIRCLE bullet;
    int8_t bullet_x_velocity;
    int8_t bullet_y_velocity;

    LCD_write_string("TIME:",80,0,BLACK,5);

    LCD_draw_hline(10,BLACK);

    timer_count = 0;
    timer_delay = 20;
    while(timer_delay);

    //enter game loop
    while(player_state == ALIVE)
    {
        ADC14->CTL0 |= ADC14_CTL0_SC;       //start ADC conversion
        if(timer_trigger)
        {
            xdir = NONE;
            ydir = NONE;

            //logic to move player around
            if((bit_joy_x > JOY_HIGH_THRESHOLD) && (player.x >= 1))
            {
                LCD_erase_circle(player);
                player.x--;
                LCD_draw_circle(player);
                xdir = LEFT;
            }
            else if((bit_joy_x < JOY_LOW_THRESHOLD) && player.x <= (LCD_MAX_X-player.radius))
            {
                LCD_erase_circle(player);
                player.x++;
                LCD_draw_circle(player);
                xdir = RIGHT;
            }
            if((bit_joy_y > JOY_HIGH_THRESHOLD) && player.y <= (LCD_MAX_Y-player.radius))
            {
                LCD_erase_circle(player);
                player.y++;
                LCD_draw_circle(player);
                ydir = UP;
            }
            else if((bit_joy_y < JOY_LOW_THRESHOLD) && ((player.y - player.radius) >= 12))
            {
                LCD_erase_circle(player);
                player.y--;
                LCD_draw_circle(player);
                ydir = DOWN;
            }

            //logic for movement of obstacle 1
            LCD_erase_rectangle(obs_1);
            if(obs_1.x <= 0)
                obs_1_x_velocity = obs_speed;
            else if(obs_1.x >= (LCD_MAX_X - obs_1.width))
                obs_1_x_velocity = -1 * obs_speed;
            if(obs_1.y <= 11)
                obs_1_y_velocity = obs_speed;
            else if(obs_1.y >= (LCD_MAX_Y - obs_1.height))
                obs_1_y_velocity = -1 * obs_speed;
            if (obs_1_state != PAUSED)
            {
                obs_1.x += obs_1_x_velocity;
                obs_1.y += obs_1_y_velocity;
            }
            LCD_draw_rectangle(obs_1);

            //logic for movement of obstacle 2
            if(obs_2_state != DEAD)
            {
                LCD_erase_rectangle(obs_2);
                if(obs_2.x <= 0)
                    obs_2_x_velocity = obs_speed;
                else if(obs_2.x >= (LCD_MAX_X - obs_2.width))
                    obs_2_x_velocity = -1 * obs_speed;
                if(obs_2.y <= 11)
                    obs_2_y_velocity = obs_speed;
                else if(obs_2.y >= (LCD_MAX_Y - obs_2.height))
                    obs_2_y_velocity = -1 * obs_speed;
                if (obs_2_state != PAUSED)
                {
                    obs_2.x += obs_2_x_velocity;
                    obs_2.y += obs_2_y_velocity;
                }
                LCD_draw_rectangle(obs_2);
            }
            //after a certain amount of time, add obstacle 2
            else if(timer_count >= DODGE_OBS_2_DELAY)
            {
                obs_2_state = ALIVE;
            }

            //logic for movement of obstacle 3
            if(obs_3_state != DEAD)
            {
                LCD_erase_rectangle(obs_3);
                if(obs_3.x <= 0)
                {
                    obs_3_x_velocity = obs_speed;
                }
                else if(obs_3.x >= (LCD_MAX_X - obs_3.width))
                {
                    obs_3_x_velocity = -1 * obs_speed;
                }
                if(obs_3.y <= 11)
                {
                    obs_3_y_velocity = obs_speed;
                }
                else if(obs_3.y >= (LCD_MAX_Y - obs_3.height))
                {
                    obs_3_y_velocity = -1 * obs_speed;
                }
                if (obs_3_state != PAUSED)
                {
                    obs_3.x += obs_3_x_velocity;
                    obs_3.y += obs_3_y_velocity;
                }
                LCD_draw_rectangle(obs_3);
            }
            //after a certain amount of time, add obstacle 3
            else if(timer_count >= DODGE_OBS_3_DELAY)
            {
                obs_3_state = ALIVE;
            }

            //logic for movement of obstacle 4
            if(obs_4_state == ALIVE)
            {
                LCD_erase_rectangle(obs_4);
                if(obs_4.x <= 0){
                    obs_4_x_velocity = obs_speed;
                }
                else if(obs_4.x >= (LCD_MAX_X - obs_4.width)){
                    obs_4_x_velocity = -1 * obs_speed;
                }
                if(obs_4.y <= 11){
                    obs_4_y_velocity = obs_speed;
                }
                else if(obs_4.y >= (LCD_MAX_Y - obs_4.height)){
                    obs_4_y_velocity = -1 * obs_speed;
                }
                if (obs_4_state != PAUSED)
                {
                    obs_4.x += obs_4_x_velocity;
                    obs_4.y += obs_4_y_velocity;
                }
                LCD_draw_rectangle(obs_4);
            }
            //after a certain amount of time, add obstacle 3
            else if(timer_count >= DODGE_OBS_4_DELAY)
            {
                obs_4_state = ALIVE;
            }

            //check collisions with obstacles, if a collision then the player is dead
            if(check_rect_circ_collision(obs_1, player))
            {
                player_state = DEAD;
            }
            else if(obs_2_state == ALIVE && check_rect_circ_collision(obs_2, player))
            {
                player_state = DEAD;
            }
            else if(obs_3_state == ALIVE && check_rect_circ_collision(obs_3, player))
            {
                player_state = DEAD;
            }
            else if(obs_4_state == ALIVE && check_rect_circ_collision(obs_4, player))
            {
                player_state = DEAD;
            }

            //if the game goes long enough increase the speed
            if(timer_count == 100)
            {
                obs_speed = 2;
            }

            //Spawn Bullet
            if (button_flag && (bullet_state == DEAD) && ((xdir != NONE) || (ydir != NONE)))
            {
                bullet_state = ALIVE;
                initialize_circle(&bullet,player.x,player.y,DODGE_PLAYER_RADIUS-2,RED,RED);

                if (xdir == LEFT)
                    bullet_x_velocity = 2 * -1 * obs_speed;
                else if (xdir == RIGHT)
                    bullet_x_velocity = 2 * obs_speed;
                else
                    bullet_x_velocity = 0;

