Dishoungh/MSP432_Game_System/game.c
                if (ydir == UP)
                    bullet_y_velocity = 2 * obs_speed;
                else if (ydir == DOWN)
                    bullet_y_velocity = 2 * -1 * obs_speed;
                else
                    bullet_y_velocity = 0;


                button_flag = 0;
            }

            if (bullet_state == ALIVE)
            {
                /* Checks Collision with Borders or any Obstacles; If so, destroy bullet */
                if (check_rect_circ_collision(obs_1, bullet))          // Collision with Obstacle 1
                {
                    LCD_erase_circle(bullet);
                    bullet_state = DEAD;

                    // Stop Obstacle 1 for a brief period of time
                    obs_1_state = PAUSED;
                }
                else if (check_rect_circ_collision(obs_2, bullet))     // Collision with Obstacle 2
                {
                    LCD_erase_circle(bullet);
                    bullet_state = DEAD;

                    // Stop Obstacle 2 for a brief period of time
                    obs_2_state = PAUSED;
                }
                else if (check_rect_circ_collision(obs_3, bullet))     // Collision with Obstacle 3
                {
                    LCD_erase_circle(bullet);
                    bullet_state = DEAD;

                    // Stop Obstacle 3 for a brief period of time
                    obs_3_state = PAUSED;
                }
                else if (check_rect_circ_collision(obs_4, bullet))     // Collision with Obstacle 4
                {
                    LCD_erase_circle(bullet);
                    bullet_state = DEAD;

                    // Stop Obstacle 4 for a brief period of time
                    obs_4_state = PAUSED;
                }
                else if (((bullet.x <= 0) || (bullet.x >= (LCD_MAX_X - bullet.radius)) || (bullet.y <= 11) || (bullet.y >= (LCD_MAX_Y - bullet.radius)))) // Collision with Any Border
                {
                    LCD_erase_circle(bullet);
                    bullet_state = DEAD;
                }

                /* Bullet Movement Logic */
                if(bullet_state != DEAD)
                {
                    LCD_erase_circle(bullet);
                    bullet.x += bullet_x_velocity;
                    bullet.y += bullet_y_velocity;
                    LCD_draw_circle(bullet);
                }

            }

            if (obs_1_state == PAUSED)
            {
                obs_1_pause++;

                if (obs_1_pause >= DODGE_OBS_PAUSE_DELAY)
                {
                    obs_1_pause = 0;
                    obs_1_state = ALIVE;
                }
            }

            if (obs_2_state == PAUSED)
            {
                obs_2_pause++;

                if (obs_2_pause >= DODGE_OBS_PAUSE_DELAY)
                {
                    obs_2_pause = 0;
                    obs_2_state = ALIVE;
                }
            }

            if (obs_3_state == PAUSED)
            {
                obs_3_pause++;

                if (obs_3_pause >= DODGE_OBS_PAUSE_DELAY)
                {
                    obs_3_pause = 0;
                    obs_3_state = ALIVE;
                }
            }

            if (obs_4_state == PAUSED)
            {
                obs_4_pause++;

                if (obs_4_pause >= DODGE_OBS_PAUSE_DELAY)
                {
                    obs_4_pause = 0;
                    obs_4_state = ALIVE;
                }
            }

            //print time survived
            itoa(timer_count,timer_count_string);
            LCD_write_string(timer_count_string,40,0,BLACK,sizeof(timer_count_string)/sizeof(uint8_t));
            timer_trigger = 0;
        }
    }

    LCD_erase_screen();

    //find final time and reset it
    uint16_t score = timer_count;
    timer_count = 0;
    uint8_t score_string[5] = "     ";
    itoa(score,score_string);

    //print ending screen
    LCD_write_string("GAME OVER",40,60,RED,9);
    LCD_write_string("TIME ALIVE:",55,40,NAVY,11);
    LCD_write_string(score_string,15,40,NAVY,sizeof(score_string)/sizeof(uint8_t));

    button_flag = 0;

    while(!button_flag);

    timer_count = 30;
}
//rectangle collision function
//returns 1 if collision, 0 otherwise
uint8_t check_rect_collision(RECT rect0, RECT rect1){
    if(((rect1.x + rect1.width) > rect0.x) && (rect1.x < (rect0.x + rect0.width)) && ((rect1.y + rect1.height) > rect0.y) && (rect1.y < (rect0.y + rect0.height))){
        return 1;
    }
    else{
        return 0;
    }
}
//rectangle, circle collision function
//returns 1 if collision, 0 otherwise
uint8_t check_rect_circ_collision(RECT rect, CIRCLE circ){
    if(((circ.x + circ.radius) > rect.x) && ((circ.x - circ.radius) < (rect.x + rect.width)) && ((circ.y + circ.radius) > rect.y) && ((circ.y - circ.radius) < (rect.y + rect.height))){
        return 1;
    }
    else{
        return 0;
    }
}

//bottom button interrupt handler
void PORT3_IRQHandler(void){
    if(P3->IFG & BIT3){
        if(!(P3->IN & BIT3)){
            button_flag = 1;
        }
        for(uint32_t i = 0; i < 100000; i++);
        P3->IFG &= ~BIT3;
    }
}

//top button interrupt handler
void PORT5_IRQHandler(void){
    if(P5->IFG & BIT1){
        for(uint32_t i = 0; i < 10000; i++);       //wait for button to stop bouncing
        if(!(P5->IN & BIT1)){                       //check to make sure button is low after bouncing
            button_flag = 1;
        }
        P5->IFG &= ~BIT1;
    }
}
